Table of Contents
 Enum CheckResultType
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Check result type
public enum CheckResultType
Fields
Capacity = 0
calculation of capacity by the interaction diagram
CrackWidth = 7
crack width check
Deflection = 10
deflection
Detailing = 8
detailing check
Fatigue = 5
calculation - response for fatigue
Interaction = 4
interaction shear+torsion
Response = 1
calculation plane of deformation
Shear = 2
shear check
Stiffness = 9
stiffness
StressLimitation = 6
stress limitation check
Torsion = 3
torsion check
Fields
 Name |  Description
 Capacity = 0
calculation of capacity by the interaction diagram
 CrackWidth = 7
crack width check
 Deflection = 10
deflection
 Detailing = 8
detailing check
 Fatigue = 5
calculation - response for fatigue
 Interaction = 4
interaction shear+torsion
 Response = 1
calculation plane of deformation
 Shear = 2
shear check
 Stiffness = 9
stiffness
 StressLimitation = 6
stress limitation check
 Torsion = 3
torsion check
 Edit this page